{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.3.1", "config": {"output_layers": [["decoder_dense", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "encoder_inputs", "config": {"batch_input_shape": [null, null], "name": "encoder_inputs", "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "name": "encoder_embedding", "config": {"batch_input_shape": [null, 23], "name": "encoder_embedding", "trainable": true, "dtype": "float32", "mask_zero": false, "activity_regularizer": null, "input_length": 23, "output_dim": 256, "input_dim": 1344, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "embeddings_constraint": null}, "class_name": "Embedding"}, {"inbound_nodes": [], "name": "decoder_inputs", "config": {"batch_input_shape": [null, null, 1630], "name": "decoder_inputs", "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["encoder_embedding", 0, 0, {}]]], "name": "encoder_lstm", "config": {"name": "encoder_lstm", "unit_forget_bias": true, "trainable": true, "go_backwards": false, "use_bias": true, "recurrent_activation": "sigmoid", "return_sequences": false, "recurrent_constraint": null, "kernel_regularizer": null, "unroll": false, "recurrent_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "recurrent_dropout": 0.0, "return_state": true, "units": 256, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "activation": "tanh", "dtype": "float32", "bias_constraint": null, "implementation": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "class_name": "LSTM"}, {"inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "name": "decoder_lstm", "config": {"name": "decoder_lstm", "unit_forget_bias": true, "trainable": true, "go_backwards": false, "use_bias": true, "recurrent_activation": "sigmoid", "return_sequences": true, "recurrent_constraint": null, "kernel_regularizer": null, "unroll": false, "recurrent_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "recurrent_dropout": 0.0, "return_state": true, "units": 256, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "activation": "tanh", "dtype": "float32", "bias_constraint": null, "implementation": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}, "class_name": "LSTM"}, {"inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "name": "decoder_dense", "config": {"name": "decoder_dense", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "units": 1630, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "softmax", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]]}}