{"class_name": "Model", "keras_version": "2.3.1", "backend": "tensorflow", "config": {"input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "encoder_inputs", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null], "name": "encoder_inputs"}}, {"class_name": "Embedding", "name": "encoder_embedding", "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "config": {"trainable": true, "input_length": 23, "dtype": "float32", "input_dim": 1730, "output_dim": 256, "embeddings_constraint": null, "batch_input_shape": [null, 23], "name": "encoder_embedding", "embeddings_regularizer": null, "mask_zero": false, "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}}}, {"class_name": "InputLayer", "name": "decoder_inputs", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, 1905], "name": "decoder_inputs"}}, {"class_name": "LSTM", "name": "encoder_lstm", "inbound_nodes": [[["encoder_embedding", 0, 0, {}]]], "config": {"units": 256, "dropout": 0.0, "implementation": 2, "kernel_constraint": null, "recurrent_activation": "sigmoid", "dtype": "float32", "activation": "tanh", "name": "encoder_lstm", "go_backwards": false, "use_bias": true, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "return_state": true, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "stateful": false, "recurrent_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null}}, {"class_name": "LSTM", "name": "decoder_lstm", "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "config": {"units": 256, "dropout": 0.0, "implementation": 2, "kernel_constraint": null, "recurrent_activation": "sigmoid", "dtype": "float32", "activation": "tanh", "name": "decoder_lstm", "go_backwards": false, "use_bias": true, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "return_state": true, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "stateful": false, "recurrent_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null}}, {"class_name": "Dense", "name": "decoder_dense", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "config": {"units": 1905, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "decoder_dense", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}], "output_layers": [["decoder_dense", 0, 0]]}}