{"backend": "tensorflow", "keras_version": "2.3.1", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "encoder_inputs", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null], "name": "encoder_inputs", "sparse": false}}, {"inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "name": "encoder_embedding", "class_name": "Embedding", "config": {"trainable": true, "input_length": 24, "embeddings_constraint": null, "embeddings_regularizer": null, "output_dim": 256, "activity_regularizer": null, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "batch_input_shape": [null, 24], "name": "encoder_embedding", "dtype": "float32", "input_dim": 1625}}, {"inbound_nodes": [], "name": "decoder_inputs", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 1349], "name": "decoder_inputs", "sparse": false}}, {"inbound_nodes": [[["encoder_embedding", 0, 0, {}]]], "name": "encoder_lstm", "class_name": "LSTM", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 256, "stateful": false, "unroll": false, "dropout": 0.0, "return_state": true, "bias_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "go_backwards": false, "activation": "tanh", "recurrent_activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "encoder_lstm", "use_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "return_sequences": false, "kernel_constraint": null}}, {"inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "name": "decoder_lstm", "class_name": "LSTM", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 256, "stateful": false, "unroll": false, "dropout": 0.0, "return_state": true, "bias_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "go_backwards": false, "activation": "tanh", "recurrent_activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "decoder_lstm", "use_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "return_sequences": true, "kernel_constraint": null}}, {"inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "name": "decoder_dense", "class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 1349, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_dense", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "activation": "softmax"}}], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "output_layers": [["decoder_dense", 0, 0]], "name": "model_1"}}