{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.3.1", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "encoder_inputs", "config": {"batch_input_shape": [null, null], "dtype": "float32", "name": "encoder_inputs", "sparse": false}}, {"inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "class_name": "Embedding", "name": "encoder_embedding", "config": {"input_length": 24, "dtype": "float32", "output_dim": 256, "input_dim": 1625, "batch_input_shape": [null, 24], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_constraint": null, "embeddings_regularizer": null, "trainable": true, "mask_zero": false, "activity_regularizer": null, "name": "encoder_embedding"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "decoder_inputs", "config": {"batch_input_shape": [null, null, 1349], "dtype": "float32", "name": "decoder_inputs", "sparse": false}}, {"inbound_nodes": [[["encoder_embedding", 0, 0, {}]]], "class_name": "LSTM", "name": "encoder_lstm", "config": {"units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "go_backwards": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "return_sequences": false, "activity_regularizer": null, "unit_forget_bias": true, "unroll": false, "recurrent_dropout": 0.0, "dropout": 0.0, "dtype": "float32", "recurrent_regularizer": null, "return_state": true, "kernel_constraint": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "stateful": false, "use_bias": true, "name": "encoder_lstm"}}, {"inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "class_name": "LSTM", "name": "decoder_lstm", "config": {"units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "go_backwards": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "unroll": false, "recurrent_dropout": 0.0, "dropout": 0.0, "dtype": "float32", "recurrent_regularizer": null, "return_state": true, "kernel_constraint": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "stateful": false, "use_bias": true, "name": "decoder_lstm"}}, {"inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "class_name": "Dense", "name": "decoder_dense", "config": {"units": 1349, "dtype": "float32", "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "decoder_dense"}}], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "name": "model_1", "output_layers": [["decoder_dense", 0, 0]]}}