{"class_name": "Model", "config": {"input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "name": "encoder_inputs", "sparse": false}, "name": "encoder_inputs", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "encoder_embedding", "dtype": "float32", "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "batch_input_shape": [null, 24], "embeddings_constraint": null, "activity_regularizer": null, "input_length": 24, "embeddings_regularizer": null, "output_dim": 256, "input_dim": 1656, "mask_zero": false}, "name": "encoder_embedding", "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 1394], "dtype": "float32", "name": "decoder_inputs", "sparse": false}, "name": "decoder_inputs", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "trainable": true, "return_state": true, "units": 256, "activation": "tanh", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "stateful": false, "bias_constraint": null, "name": "encoder_lstm", "dtype": "float32", "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "implementation": 2, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "kernel_regularizer": null, "return_sequences": false, "use_bias": true, "kernel_constraint": null, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "recurrent_activation": "sigmoid"}, "name": "encoder_lstm", "inbound_nodes": [[["encoder_embedding", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "trainable": true, "return_state": true, "units": 256, "activation": "tanh", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "stateful": false, "bias_constraint": null, "name": "decoder_lstm", "dtype": "float32", "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "implementation": 2, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "use_bias": true, "kernel_constraint": null, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "recurrent_activation": "sigmoid"}, "name": "decoder_lstm", "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]]}, {"class_name": "Dense", "config": {"name": "decoder_dense", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 1394, "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null}, "name": "decoder_dense", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]]}], "output_layers": [["decoder_dense", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}